{
  "title": "Initiating Phase",
  "summary": "",
  "sections": [
    {
      "number": "5.0",
      "title": "Overview",
      "markdown": "# Initiating Phase\n\nThe first phase of a PM² project is the Initiating Phase. It begins with the identification of a need, problem or opportunity, and ends with the establishment of the plans and processes needed to take the project forward. Proper project initiation is critical for successful project planning and execution. It involves defining project objectives and constraints, and receiving formal organisational sponsorship for the project.\n\n![](/pm2/figures/fig-5-1.png)\n\n**Fig 5.1** Initiating Phase activities and main outputs\n**Artefacts**\n**Fig 5.2** Initiating Phase artefacts"
    },
    {
      "number": "5.1",
      "title": "Initiating Meeting",
      "markdown": "## Initiating Meeting\n\nThis is an informal meeting, usually between the project initiator and the Project Owner (PO), and others who could potentially contribute to the creation of the Initiating Phase documents. The goal of this meeting is to introduce any pre-project information and discuss the next steps.\nThe result of this meeting is a better understanding of the context of the (future) project, as well as a decision to move forward with the creation of the Project Initiation Request. Documentation and lessons learned from previous similar projects can also be used as input to this meeting."
    },
    {
      "number": "5.2",
      "title": "Project Initiation Request",
      "markdown": "## Project Initiation Request\n\nThe Project Initiation Request is a project's starting point and formalises its initiation. By creating a Project Initiation Request, the project initiator ensures that the current context/situation (i.e. problem, need or opportunity) and the project's desired outcomes are formally captured and can be used as a basis for further exploration and elaboration.\nThe Project Initiation Request contains basic information about the estimated effort and cost of undertaking the project as well as the timeframe for its completion and the type of delivery. Specifically, the document describes the impact the project is expected to bring and summarises the success criteria against which it will be evaluated. Additionally, the Project Initiation Request outlines the project's relevance to the organisation's strategic direction and highlights the key assumptions, constraints and risks as assessed at this stage.\n\n  ----------------------------------------------------------------\n  **Key              **Description**\n  Participants**     \n  ------------------ ---------------------------------------------\n  Initiator          Anyone can introduce a Project Initiation Request.\n\n  Project Owner (PO) The main beneficiary of the project's outputs usually nominates a Project Owner (PO).\n\n  Solution Provider  The organisational unit that will carry out the project work nominates a Solution Provider (SP).\n\n  Approver           Depending on the project, the Project Owner (PO) or a higher-level Appropriate Governance Body (AGB) can accept the Project Initiation Request and authorise work on a more elaborate Business Case.\n  ----------------------------------------------------------------\n\n#### Input\n\n- A problem, a need or an opportunity expressed by the initiator.\n\n#### Guidelines\n\n- Note that though anyone can initiate a Project Initiation Request, in many cases the Project Owner (PO) delegates its creation to the Business Manager (BM).\n- Know your audience: Depending on the project size and the organisation's approval process, approval can be informal (i.e. the Project Owner (PO) accepts it), or formal (i.e. an Appropriate Governance Body (AGB) reviews and approves it).\n- Ensure all the relevant information is included, but at this point limit details to high-level information---finer points will be added in the form of the Business Case and other Project artefacts.\n\n#### Steps (for a project's initiation)\n\n1. The Project Initiation Request is drafted.\n2. The Project Initiation Request is submitted for approval to the relevant Governing or Steering Level role.\n3. Once the Project Initiation Request is approved, the project is defined in more detail with a preliminary project scope description in the Business Case and further elaborated in the Project Charter.\n4. The Solution Provider (SP) assigns the Project Manager (PM) and the Project Core Team (PCT). The Project Manager (PM) is typically assigned after the Business Case is approved (or at the latest before the completion of the Project Charter), while the Project Core Team (PCT) is typically assigned before the Planning Kick-off Meeting.\n\nThe lifecycle of the Project Initiating Request ends with the creation of the Business Case and Project Charter. All the information included in the Project Initiation Request is copied over, updated and further elaborated in these two documents, which remain \"live\" until the end of the project.\n![](/pm2/figures/fig-5-3.png)\n**Fig 5.3** Relationship between the artefacts created during the Initiating Phase\n\n  --------------------------------------------------------------------------------------------------\n  **RAM** (RASCI)   **AGB**   **PSC**     **PO**      **BM**   **BIG**   **SP**   **PM**   **PCT**\n  ---------------- --------- --------- ------------- -------- --------- -------- -------- ----------\n  Project              I       n.a.     **A**/**S**   **R**    **S**/C     I       n.a.    n.a**.**\n  Initiation                                                                               \n  Request                                                                                  \n\n  --------------------------------------------------------------------------------------------------\n\n![](/pm2/figures/fig-5-4.png)\n\n**Fig 5.4** Project Initiation Request inputs and main roles\n\n+--------------------------+----------------+\n| **Outputs**              | > **PM²        |\n|                          | > Template?**  |\n+==========================+===============:+\n| - Project Initiation     | ☑              |\n|   Request                |                |\n+--------------------------+----------------+"
    },
    {
      "number": "5.3",
      "title": "Business Case",
      "markdown": "## Business Case\n\nThe purpose of the Business Case is to capture the reasoning behind the project, to describe the project's alignment with the organisation's strategic objectives, to provide a justification for the investment in time and effort, and to set out the budgetary needs. For larger strategic projects, the Business Case may also include an assessment of impact and risks along with a more detailed cost-benefit analysis.\nThe Business Case provides decision-makers with the information they need to determine whether the project is worth doing. The Business Case is a living document and therefore should be re-examined at critical project milestones to check that the expected benefits are still achievable, the costs/schedule fall within the budget/timeline, and the project is still relevant to the organisation and should be continued.\n\n  ----------------------------------------------------------------\n  **Key               **Description**\n  Participants**      \n  ------------------- --------------------------------------------\n  Project Owner (PO)  Accountable for the Business Case.\n\n  Business Manager    Creates the Business Case, supported by the Solution Provider (SP) and the Project Manager (PM) (if known).\n  (BM)                \n\n  Other project       Consulted in defining the project's Business Case\n  stakeholders        \n\n  Approver            A preliminary Project Steering Committee (PSC) or a higher-level Appropriate Governance Body (AGB)\n  ----------------------------------------------------------------\n\n#### Inputs\n\n- Project Initiation Request\n\n#### Guidelines\n\n- Note that the form and depth of analysis required for this artefact depends on the level of investment required for the project.\n- Consider several solutions that fulfil this business need and recommend one of these.\n- Describe the overall approach to how the project will be executed (project strategy).\n- Identify measurable criteria that will be used to determine the success of the project.\n- For projects carried out under contract (e.g. as a result of a bid award), create the Business Case based on the Request for Proposal, the response to this request, and the contract itself.\n\n#### Steps\n\n1. The Business Manager (BM) drafts the Business Case based on the information captured in the Project Initiation Request. The main project aspects to be analysed and presented are:\n\n    - the project's justification and impact\n    - the project's positioning in the overall organisational strategy\n    - an assessment of Strengths, Weaknesses, Opportunities and Threats (SWOT Analysis) of several solutions, one of which is proposed for implementation\n    - a cost benefit analysis, per identified solution, detailed to the extend required\n    - synergies and interdependencies with other projects and initiatives\n    - high-level project roadmap, including major milestones.\n\n2. The Project Owner (PO) evaluates the Business Case and decides to approve or reject it.\n3. The Project Owner (PO) sends the Business Case to the Appropriate Governance Body (AGB) if needed for corporate approval.\n\n+---------------+---------------+---------------+---------------+---------------+---------------+---------------+---------------+---------------+\n| **RAM**       | **AGB**       | **PSC**       | **PO**        | **BM**        | **BIG**       | **SP**        | **PM**        | **PCT**       |\n| (RASCI)       |               |               |               |               |               |               |               |               |\n+===============+:=============:+:=============:+:=============:+:=============:+:=============:+:=============:+:=============:+:=============:+\n| Business Case | I             | C             | **A**         | **R**         | C             | **S**         | **S**         | n.a.          |\n+---------------+---------------+---------------+---------------+---------------+---------------+---------------+---------------+---------------+\n| > ![](/pm2/figures/fig-5-5.png)                                                                         |\n+-----------------------------------------------------------------------------------------------------------------------------------------------+\n\n**Fig 5.5** Business Case inputs and main roles\n\n+--------------+------------------+------------------+-----------------+------------------+---------------+\n| **Related    | > **Initiating** | > **Planning**   | > **Executing** | > **Monitor &    | > **Closing** |\n| Artefacts**  |                  |                  |                 | > Control**      |               |\n+==============+==================+==================+=================+:================:+===============+\n| **Benefits   | > Business Case  | > Business       | > Project       | > Business       | > Project-End |\n| Management** |                  | > Implementation | > Reports       | > Implementation | > Report      |\n|              |                  | > Plan           |                 | > Checklist      |               |\n+--------------+------------------+------------------+-----------------+------------------+---------------+\n\n#### Outputs PM² Template?\n\n- Business Case ☑"
    },
    {
      "number": "5.4",
      "title": "Project Charter",
      "markdown": "## Project Charter\n\nThe Project Charter provides a basis for the more detailed project planning. It defines the project's objectives (i.e. scope, time, cost, quality), high-level requirements, risks and constraints, as well as the project milestones and deliverable(s).\nThe charter is a key element of the project approval process (along with the Business Case). It includes the *what*, *how* and *when* fundamentals of the project and provides a baseline against which progress can be measured. Although the Project Charter can be initiated by the Business Manager (BM), it is ultimately the responsibility of the Project Manager (PM) to complete it and submit it for approval.\n\n  -----------------------------------------------------------------\n  **Key             **Description**\n  Participants**    \n  ----------------- -----------------------------------------------\n  Project Manager   Develops the Project Charter. Should be assisted by the Business Manager (BM) and the\n  (PM)              Solution Provider (SP).\n\n  Project Owner     Reviews and approves the Project Charter.\n  (PO)              \n\n  Decision-making   The Appropriate Governance Body (AGB) provides the corporate-level approval of the Project\n  Body              Charter.\n  -----------------------------------------------------------------\n\n#### Inputs\n\n- Project Initiation Request\n- Business Case\n\n#### Guidelines\n\n- The Project Charter should be brief so that it can be sent to project stakeholders as soon as possible, and so that it is easy for them to review and understand.\n- Avoid presenting detailed requirements. Instead present high-level needs and features.\n- Detailed requirements may be captured in other artefacts (e.g. in a Requirements Document), or in an appendix to the Project Charter to be elaborated during the planning phase.\n- Ensure that input from all concerned project stakeholders is considered.\n- Ensure that once created, the Project Charter is updated and distributed as required.\n\n#### Steps\n\n1. The Business Manager (BM) will first consult the main project stakeholders and takes part in drafting the Project Charter.\n2. The Project Manager (PM) is responsible for delivering the document.\n3. The main project stakeholders review the Project Charter and the Project Steering Committee (PSC) accepts it.\n4. The Project Owner (PO) sends the Business Case and Project Charter to the appropriate decision-making body for additional approval, if needed.\n5. The appropriate decision-making body evaluates and accepts or rejects the Project Charter.\n\n+-------------------+---------+---------+--------+--------+---------+--------+--------+---------+\n| > **RAM** (RASCI) | **AGB** | **PSC** | **PO** | **BM** | **BIG** | **SP** | **PM** | **PCT** |\n+===================+:=======:+:=======:+:======:+:======:+:=======:+:======:+:======:+:=======:+\n| Project Charter   | I       | **A**   | **C**  | **S**  | C       | **S**  | **R**  | C       |\n+-------------------+---------+---------+--------+--------+---------+--------+--------+---------+\n\n![](/pm2/figures/fig-5-6.png)\n\n**Fig 5.6** Project Charter inputs and main roles\n\n+--------------+------------------+----------------+-----------------+-----------+---------------+\n| **Related    | > **Initiating** | > **Planning** | > **Executing** | **Monitor | > **Closing** |\n| Artefacts**  |                  |                |                 | &         |               |\n|              |                  |                |                 | Control** |               |\n+==============+==================+================+=================+:=========:+===============+\n| **Scope      | > Business Case  | > Project Work | > Change        | Project   | > Project-End |\n| Management** |                  | > Plan         | > Requests      | Logs      | > Report      |\n|              |                  |                | > Project       |           |               |\n|              |                  |                | > Reports       |           |               |\n+--------------+------------------+----------------+-----------------+-----------+---------------+\n\n#### Outputs PM² Template?\n\n- Project Charter ☑"
    },
    {
      "number": "5.5",
      "title": "Phase Gate RfP (Ready for Planning)",
      "markdown": "## Phase Gate RfP (Ready for Planning)\n\nThis is the first phase gate. A review and approval are recommended before the project can formally move to the next phase. The Project Manager (PM) assesses whether the project is ready to commence the Planning Phase and seeks approval of the Business Case and Project Charter from the Project Steering Committee (PSC). If the Business Case or Project Charter is not approved, the project proceeds directly to the Closing Phase for Lessons Learned and archiving.\nPM² provides a template Phase Exit Review Checklist for each phase that can be used by the Project Manager (PM) to guide the assessment, alongside a review of the phase's specific goals."
    }
  ]
}