{
  "title": "PM² Methodology Overview",
  "summary": "",
  "sections": [
    {
      "number": "3.1",
      "title": "The House of PM²",
      "markdown": "# The House of PM²\n\nThe PM² Methodology is built on Project Management best practices and is supported by four pillars:\n\n1. a project governance model (i.e. Roles & Responsibilities)\n2. a project lifecycle (i.e. Project Phases)\n3. a set of processes (i.e. project management activities)\n4. a set of project Artefacts (i.e. documentation templates and guidelines).\n\n![](/pm2/figures/fig-3-1.png)\n\n**Fig 3.1** The House of PM²\nThe spirit of the PM² Methodology is further defined by the PM² Mindsets, which provide the glue that holds together the PM² practices and provide a common set of beliefs and values for PM² project teams."
    },
    {
      "number": "3.2",
      "title": "The PM² Lifecycle",
      "markdown": "# The PM² Lifecycle\n\nThe PM² project lifecycle has four sequential and non-overlapping phases with a different type of activity predominant in each phase (i.e. initiating activities are predominant in the Initiating Phase, etc.). However, while phase-related activities peak in terms of effort during a specific phase, activities of this type can also be executed during neighbouring phase(s) (e.g. planning activities are also repeated in the Executing Phase).\n![](/pm2/figures/fig-3-2.png)A project moves on to the next phase when the goals of its current phase have been deemed achieved as the results of a formal (or less formal) phase-exit review.\n**Fig 3.2** The PM² project lifecycle: indicative overlap of phase activities and cumulative effort\nThe focus of a project shifts from initiating and planning activities in the beginning to executing, monitoring and controlling activities in the middle and acceptance, transitioning and closing activities at the end.\nInexperienced project teams sometimes underestimate the importance of the work done in the initial project phases and start working on deliverables that are inadequately defined or planned. This results in the delivery of outputs, which are of poor quality and of little value to end-users. This is a common and costly mistake, which is often the root cause of overall project failure and the failure to realise the project's intended benefits. It is therefore important to invest adequate time during the Initiating Phase to define the desired outcomes by engaging a broad spectrum of stakeholders.\n\n+---------------------------------+---------------------------------------------------+\n| **Project Phase**               | **Description**                                   |\n+=================================+===================================================+\n| > **1. Initiating**             | Define the desired outcomes. Create a Business    |\n|                                 | Case. Define the project scope. Get               |\n|                                 |                                                   |\n|                                 | the project off to a good start.                  |\n+---------------------------------+---------------------------------------------------+\n| > **2. Planning**               | Assign the Project Core Team (PCT). Elaborate the |\n|                                 | project scope. Plan the work.                     |\n+---------------------------------+---------------------------------------------------+\n| > **3. Executing**              | Coordinate the execution of project plans.        |\n|                                 | Produce deliverables.                             |\n+---------------------------------+---------------------------------------------------+\n| > **4. Closing**                | Coordinate formal acceptance of the project.      |\n|                                 | Report on project performance. Capture Lessons    |\n|                                 | Learned and post-project recommendations. Close   |\n|                                 | the project                                       |\n|                                 |                                                   |\n|                                 | administratively.                                 |\n+---------------------------------+---------------------------------------------------+\n|                                                                                     |\n+---------------------------------+---------------------------------------------------+\n| > **Monitor & Control**         | Oversee all project work and management           |\n|                                 | activities over the duration of the project:      |\n|                                 | monitor project performance, measure progress,    |\n|                                 | manage changes, address risks and issues,         |\n|                                 | identify corrective actions etc.                  |\n+---------------------------------+---------------------------------------------------+"
    },
    {
      "number": "3.2.1",
      "title": "Initiating Phase",
      "markdown": "### Initiating Phase\n\n![](media/image20.png)\n\nThe first phase of a PM² project is the Initiating Phase. During this phase, the people involved formulate the project's objective(s), ensure the project's alignment to the organisation's strategic objectives, undertake some initial planning to get the project off to a good start, and put together the information required to gain approval to continue to the Planning Phase. The main input of this phase is a (client) request to address a need, problem or opportunity.\nThe following activities are part of the Initiating Phase:\n\n- Creation of the Project Initiation Request which contains information about the requestor, business needs and the desired project outcomes.\n- Creation of the Business Case, which provides a business justification, defines the project's budgetary requirements, and outlines the business context, problem and project descriptions, alternative solutions, and a high-level roadmap.\n- ![](/pm2/figures/fig-3-3.png)Creation of the Project Charter, which provides more details on the project definition in terms of scope, cost, time and risk. It also defines milestones, deliverables, project organisation, etc.\n\n**Fig 3.3** Overview of the Initiating Phase\nThe Business Case and Project Charter define the project's scope and direction. The Project Manager (PM) and the Project Core Team (PCT) reference and use both throughout the project.\nAt the end of the Initiating Phase, the Project Steering Committee (PSC) or other Appropriate Governance Body (AGB) reviews the above documents and decides whether to allow the project to move forward."
    },
    {
      "number": "3.2.2",
      "title": "Planning Phase",
      "markdown": "### Planning Phase\n\n![](media/image28.png)\n\nThe second phase of a PM² project is the Planning Phase. During the Planning Phase, the project's objective is developed into a specific and workable plan ready to be executed. The Project Work Plan specifies the project scope and appropriate approach, decides on a schedule for the tasks involved, estimates the necessary resources and develops the detail of the project plans. Several times during the Planning Phase, the Project Work Plan can be updated. Once agreed and finalised it is baselined and signed off.\nThe following activities are part of the Planning Phase:\n\n- Running the Planning Kick-off Meeting to officially start the Planning Phase.\n- Creating the Project Handbook, which defines the project's management approach.\n- Developing the Project Work Plan (Work Breakdown, Effort and Costs, Schedule).\n- Updating the Project Stakeholder Matrix, which identifies all project stakeholders.\n- Creating other important plans such as the Communications Management Plan, the Transition Plan and the Business Implementation Plan.\n\n![](/pm2/figures/fig-3-4.png)\n\n**Fig 3.4** Overview of the Planning Phase\nThe Project Manager (PM) uses the outputs of the Planning Phase to request approval to move on to the Executing Phase. This decision to move on is taken by the Project Steering Committee (PSC)."
    },
    {
      "number": "3.2.3",
      "title": "Executing Phase",
      "markdown": "### Executing Phase\n\n![](media/image33.png)\n\nThe third phase of a PM² project is the Executing Phase. During the Executing Phase the project team produces the project deliverables (outputs) as outlined in the Project Work Plan. This is typically the stage of the project lifecycle that involves the most resources and requires the most monitoring.\nThe following activities are part of the Executing Phase:\n\n- Running the Executing Kick-off Meeting.\n- Distributing information based on the Communications Management Plan.\n- Performing Quality Assurance (QA) activities as defined in the Quality Management Plan.\n- Coordinating project, work people and resources, and resolving conflicts and issues.\n- Producing the project deliverables in accordance with the project plans.\n- Handing over the deliverables as described in the Deliverables Acceptance Plan.\n\n![](/pm2/figures/fig-3-5.png)\n**Fig 3.5** Overview of the Executing Phase\nOnce the project deliverables have been accepted by the Project Owner (PO), the Project Manager (PM) can request approval to move on to the Closing Phase. This decision to move on is taken by the Project Steering Committee (PSC)."
    },
    {
      "number": "3.2.4",
      "title": "Closing Phase",
      "markdown": "### Closing Phase\n\n![](media/image37.png)\n\nThe final phase of a PM² project is the Closing Phase.\nDuring a project's Closing Phase, the finished deliverables are officially transferred into the care, custody and control of the Project Owner (PO) and the project is administratively closed. Information on overall project performance and Lessons Learned is captured in the Project-End Report. The Project Manager (PM) ensures that the deliverables produced are accepted, all project documents are correctly filed and archived, and that all resources used by the project are formally released.\nThe following activities are part of the Closing Phase:\n\n- Finalising all activities in order to formally close the project.\n- Discussing the overall project experience and Lessons Learned with the project team.\n- Documenting Lessons Learned and best practices for future projects.\n- Closing the project administratively and archiving all project documents.\n\n![](/pm2/figures/fig-3-6.png)\n\n**Fig 3.6** Overview of the Closing Phase"
    },
    {
      "number": "3.2.5",
      "title": "Monitor & Control",
      "markdown": "### Monitor & Control\n\n![](media/image41.png)\n\nMonitor & Control activities run throughout the project's lifecycle. During Monitor & Control, all work is observed from the point of view of the Project Manager (PM). Monitoring is about measuring ongoing activities and assessing project performance against project plans. Controlling is about identifying and taking corrective action to address deviations from plans and to address issues and risks.\n![](/pm2/figures/fig-3-7.png)\n**Fig 3.7** Monitor & Control activities"
    },
    {
      "number": "3.2.6",
      "title": "Phase Gates and Approvals",
      "markdown": "### Phase Gates and Approvals\n\nAt the end of each phase, the project passes through a review and approval gate. This ensures that the project is reviewed by the appropriate people (i.e. the Project Manager (PM), Project Owner (PO), the Project Steering Committee (PSC) or other delegated role) before it moves on to the next phase. These checkpoints contribute to the overall project management quality and allow the project to proceed in a more controlled way.\n\n#### The three PM² phase gates are:\n\n- **RfP** (Ready for Planning): at the end of the Initiating Phase\n- **RfE** (Ready for Executing): at the end of the Planning Phase\n- **RfC** (Ready for Closing): at the end of the Executing Phase."
    },
    {
      "number": "3.3",
      "title": "PM² Phase Drivers and Key Artefacts",
      "markdown": "## PM² Phase Drivers and Key Artefacts\n\nProjects depend on people to define, plan and execute them. These project drivers change from phase to phase in a PM² project.\nDuring the Initiating Phase, the Project Owner (PO) is the main driver, initiating the project and being accountable for all documentation.\nIn the Planning Phase, the main driver is the Project Manager (PM), who is responsible for coordinating the delivery of all project plans.\nThe carrying out of the Project Work Plan and creation of the project deliverables in the Executing Phase is driven by the Project Core Team (PCT).\nFinally, the Closing Phase is driven by the stakeholders who evaluate the project's overall performance.\n![](/pm2/figures/fig-3-8.png)\n\n**Fig 3.8** PM² Swimlane Diagram\n\n+----------------+---------------------------------------------+\n| **Key Phase    | **Description**                             |\n| Input/Output** |                                             |\n+================+=============================================+\n| **Project      | Formalises the commitment to explore a      |\n| Initiation     | problem, need or opportunity further and    |\n| Request**      | captures the context.                       |\n+----------------+---------------------------------------------+\n| **Business     | Captures the reasoning behind the project,  |\n| Case**         | provides justification and                  |\n|                |                                             |\n|                | establishes the budgetary constraints.      |\n+----------------+---------------------------------------------+\n| **Project      | Builds on the Business Case and defines the |\n| Charter**      | project scope, high-level requirements and  |\n|                | deliverables.                               |\n+----------------+---------------------------------------------+\n| **Project      | Presents the project management objectives  |\n| Handbook**     | and overall management                      |\n|                |                                             |\n|                | approach. Documents the roles &             |\n|                | responsibilities.                           |\n+----------------+---------------------------------------------+\n| **Project Work | Includes a breakdown of the work to be      |\n| Plan**         | carried out, estimates of the effort and    |\n|                | costs involved, and the project schedule.   |\n+----------------+---------------------------------------------+\n| **Project      | Lists the complete set of project           |\n| Deliverables** | deliverables as defined in the Project      |\n|                |                                             |\n|                | Charter and Project Work Plan.              |\n+----------------+---------------------------------------------+\n| **Project-End  | Summarises the project experience, project  |\n| Report**       | performance and Lessons Learned (successful |\n|                | project practices and potential pitfalls).  |\n+----------------+---------------------------------------------+"
    },
    {
      "number": "3.4",
      "title": "What is a PM² Project",
      "markdown": "## What is a PM² Project\n\nMany PM² best practices can be applied to any type of project or work activity. However, to be able to apply the whole PM² Methodology, a project must have certain characteristics.\nThus, a PM² project:\n\n- is (above all) a project (i.e. not operations, not a work activity, not a programme, etc.)\n- has a duration of more than 4--5 weeks and involves more than 2--3 people\n- runs within an organisation and can be subject to internal or external audits\n- requires a clearly defined governance structure and clearly assigned roles and responsibilities\n- requires approval of its budget and scope\n- includes more than just construction/delivery activities\n- includes transition and business implementation activities\n- requires a certain level of documentation, transparency and reporting\n- requires a certain level of control and traceability\n- has a broad base of internal (and external) stakeholders\n- may require the collaboration of several organisations or organisational units\n- contributes to raising the organisation's project management maturity.\n\nThe number of the above characteristics, apparent in a project, drive the tailoring and customization that will have to be applied to the PM² methodology."
    },
    {
      "number": "3.5",
      "title": "PM² Mindsets",
      "markdown": "## PM² Mindsets\n\nThe PM² processes, artefacts, tools and techniques help project teams make decisions on trade-offs\nbetween a project's time, cost, scope and quality dimensions.\nThe PM² Mindsets are the attitudes and behaviours that help project teams focus on what is crucial to achieving their project's goals. They help project teams navigate the complexities of managing projects in organisations and make the PM² Methodology both more effective and complete.\nThus, Project Managers (PMs) and project teams that practise PM²:\n\n1. **Apply PM²** best practices to manage their projects.\n2. **Remain mindful** that project management methodologies are there to serve projects and not the other way around.\n3. Maintain an **outcomes orientation** in relation to all projects and project management activities.\n4. Are **committed to** delivering project results with **maximum value** rather than just following plans.\n5. **Foster** a project culture of collaboration, clear **communication** and **accountability**.\n6. **Assign** project roles to the most **appropriate** people for the benefit of the project.\n7. **Balance** in the most productive way the often-conflicting project management \"Ps\" of product, purpose, process, plan, planet, people, pleasure/pain, participation, perception and politics.\n8. **Invest** in developing technical and behavioural competences to **become better** project contributors.\n9. **Involve** project stakeholders in the **organisational change** needed to maximise project benefits.\n10. **Share knowledge**, actively manage Lessons Learned, and contribute to the **improvement** of project management within their organisations.\n11. Draw **inspiration** from the PM² Guidelines on Ethics and Professional Virtues (see Appendix F).\n\nTo remain mindful of the PM² Mindsets, Project Managers (PMs) and project teams that practise PM² should ask themselves the following important Infrequently Asked Questions (IAQs):\n\n- **Do we know what we are doing?** Tip: Develop a clear and shared project vision. Manage the project using a holistic approach and optimise the whole project, not just parts of it. Follow a process but stay Agile and try to regularly remind yourself why you are doing something.\n\n- **Do we know why we are doing it? Does anyone really care?** Tip: Make sure your project matters. Understand its goals, value and impact, and how it relates to the organisational strategy. Define upfront what project success is and deliver maximum value and real benefits, not just outputs.\n\n- **Are the right people involved?** Tip: People make projects work. The primary criterion for involving people and assigning project roles should be to serve the needs and objectives of the project, and not politics, friendship, functional hierarchy, proximity or convenience.\n\n- **Do we know who is doing what**? Tip: Know what you should be doing, and make sure others know what they should be doing. Is it clear to everyone? Clearly define and understand roles, responsibilities and accountabilities.\n\n- **Deliver at any cost or risk**? Tip: Show respect for people's work and organisational funds and avoid high-risk behaviour and tactics. Always keep in mind that it is not just about the end result - how you get there also matters. Manage your projects based on positive values and principles.\n\n- **Is this important**? Tip: Everything is NOT equally important. Identify, and agree on, the project's Critical Success Criteria (CSC), Minimum Viable Product (MVP), and Critical Success Factors (CSFs), and allocate effort and attention both tactically and strategically for the benefit of both the project and project management goals.\n\n- **Is this a task for \"them\" or for \"us\"**? Tip: Make sure that client and provider groups work as one team towards a common goal. Real teamwork really works; so foster clear, effective and frequent communication.\n\n- **Should I be involved**? Tip: Contribute from any position. Be proud of the skills, value and positive attitude you bring to the project. Help everyone who needs to be involved get involved. Promote and facilitate the contributions of all stakeholders.\n\n  - **Have we improved**? Tip: Commit to ongoing self- and organisational improvement by gathering and sharing knowledge. Project teams should reflect on how they can become more effective and adjust their behaviour accordingly.\n\n  - **Is there life after the project**? Tip: The product (or service) lifecycle has just begun! Make sure you have contributed to its success.\n\nThe PM² Mindsets are the glue that holds the PM² processes and practices together. They provide a common set of beliefs and values for all PM² practitioners**.**\nThe PM² Mindsets:\n\n- help project teams navigate through the complexities of project realities.\n- help project teams (re)position project management goals in a wider organisational context.\n- remind project teams what is important for project success.\n- are useful reminders of effective attitudes and behaviours."
    },
    {
      "number": "3.6",
      "title": "Tailoring and Customisation",
      "markdown": "## Tailoring and Customisation\n\nTo ensure that the PM² Methodology effectively serves an organisation's and a project's needs, some level of tailoring or/and customisation may be required.\nTailoring refers to changing specific parts of the methodology, such as process steps, the content of artefacts, the distribution of responsibilities amongst the various roles, etc. Organisations do this to adapt the methodology to the specific needs of their structure and culture, and to align the methodology to organisational processes, policies, etc.\nTailoring makes more sense at the organisation/departmental level, but some tailoring can also take place at the project level, based, for instance, on the complexity, size or type of a project. In addition to any tailoring, further customisation may also be required at the project level to reflect the project's specific management needs. Examples of such customisations are the definition of decision thresholds for escalation, risk tolerances based on the risk appetite of the stakeholders, etc.\nAll tailoring and customisations should be documented in the Project Handbook.\n\nThe following guidelines should be considered when tailoring or customising the PM² Methodology:\n\n- First, understand the purpose and value of the methodology element to be tailored, and then proceed with its tailoring.\n- Avoid simplifying the methodology by eliminating whole chunks (e.g. a phase, a role, an activity or an artefact), but rather scale down (or up) the scope of that element.\n- Balance the level of control a project needs against the extra effort such control requires.\n- Eliminate waste (lean approach) but remain aligned with the spirit of the PM² Methodology as this is reflected by its four pillars and mindsets.\n- Remember that the methodology was designed as an integrated whole, so avoid unnecessary deviations."
    },
    {
      "number": "3.7",
      "title": "PM² and Agile Management",
      "markdown": "## PM² and Agile Management\n\nPM² recognises the complex and uncertain nature of many types of project and the positive contribution of the Agile way of thinking to their effective management.\nAgile approaches meet various challenges, which often grow with the size of the organisations in which they are applied. These challenges may include coordination between Agile and non-Agile teams, compliance with various organisational governance and audit requirements, and organisational architecture and interoperability constraints.\n\n#### What is Agile?\n\nAgile is an approach to managing projects based on a specific set of principles and practices, which promote adaptive planning, evolutionary development, early incremental delivery and continuous improvement. It encourages rapid and flexible responses to change.\nAgile takes into account the inherent uncertainty of the project environment and creates an organisation that is highly adaptive. It uses short feedback loops to allow for rapid responses to changes in product requirements and for ongoing improvements to processes.\nAgile's key characteristics are:\n\n- a focus on delivering value early on and frequently throughout a project\n- decisions made based on what is known\n- close cooperation among all parties involved\n- continuous stakeholder involvement at all levels\n- involving team members in planning\n- incremental development with short cycles\n- scope management through the continuous (re)prioritisation of tasks\n- embracing change, continuous learning and improvement\n- just enough documentation and control.\n\nPM² provides a structure that helps Agile teams achieve the desired agility while still accommodating tight procurement and audit requirements, good coordination with programme and portfolio levels, and collaboration with other projects, contractors, other organisational units and external organisations (see Appendix D)."
    }
  ]
}